{
  "generatedAt": "2026-02-25T09:53:36.134933+00:00",
  "items": [
    {
      "headline": "10 richest boxers of all time and the wild amounts they’re worth",
      "source": "The Big Lead",
      "link": "https://www.thebiglead.com/10-richest-boxers-of-all-time-and-the-wild-amounts-theyre-worth/",
      "pubDate": "Sun, 22 Feb 2026 13:06:55 GMT",
      "pubDateISO": "2026-02-22T13:06:55+00:00",
      "snippet": "These icons have made fistfuls of dollars and the amount of money is staggering",
      "content": "Boxing isnt anywhere near as popular as it was decades ago, but that doesnt mean there arent still plenty of fans willing to pony up to see these prizefighters, with an emphasis on prize money. These… [+4955 chars]",
      "query": "Green Flag Ventures"
    },
    {
      "headline": "The 50 Most Powerful PR Firms of 2026",
      "source": "Observer",
      "link": "https://observer.com/list/observer-pr-power-list-2026/",
      "pubDate": "Wed, 18 Feb 2026 16:00:00 GMT",
      "pubDateISO": "2026-02-18T16:00:00+00:00",
      "snippet": "This year's honorees are emblematic of a notable shift in public relations from responsive publicity to proactive leadership in the moments that matter most.",
      "content": "Power is more than size, scope, revenue or retention. Power is the ability to move capital, culture and conversation across industries that matter; it's about what happens because you were paid to be… [+147177 chars]",
      "query": "Green Flag Ventures"
    },
    {
      "headline": "Heirs Energies ascent: Redefining Nigeria’s power and purpose",
      "source": "The Punch",
      "link": "https://punchng.com/heirs-energies-ascent-redefining-nigerias-power-and-purpose/",
      "pubDate": "Tue, 17 Feb 2026 23:52:25 GMT",
      "pubDateISO": "2026-02-17T23:52:25+00:00",
      "snippet": "Explore how Heirs Energies, led by Tony Elumelu, is transforming Nigeria’s energy sector through strategic acquisitions, boosting oil and gas production. Read More: https://punchng.com/heirs-energies-ascent-redefining-nigerias-power-and-purpose/",
      "content": "A seismic shift is vibrating through the sprawling onshore fields of the Niger Delta. In January 2021, a $1.2bn landmark deal sent a clear signal to the global markets: Heirs Energies had arrived. By… [+4479 chars]",
      "query": "Green Flag Ventures"
    },
    {
      "headline": "Stock Market Highlights: Sensex, Nifty trade in narrow range amid cautious investor sentiment",
      "source": "BusinessLine",
      "link": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-11th-february-2026/article70615320.ece",
      "pubDate": "Wed, 11 Feb 2026 10:47:32 GMT",
      "pubDateISO": "2026-02-11T10:47:32+00:00",
      "snippet": "Sensex, Nifty, Share Prices Highlights: Sensex drops 40.28 points to settle at 84,233.64; Nifty up 18.70 to 25,953.85. Both benchmarks had risen nearly 1.2% in the last three sessions, driven by optimism surrounding the U.S.-India ‌trade deal. Rupee fell 14 p…",
      "content": "February 11, 2026 16:13Stock market live today: Rupee falls 14 paise to close at 90.70 against US dollar Rupee falls 14 paise to close at 90.70 against US dollar At the interbank foreign… [+92749 chars]",
      "query": "Green Flag Ventures"
    },
    {
      "headline": "Q3 Results Today Highlights: LIC, Indian Oil, Godrej Properties, Suzlon, JSW Cement post gains; Tata Motors, Bharti Airtel, Hexaware, Jaiprakash Power slide",
      "source": "BusinessLine",
      "link": "https://www.thehindubusinessline.com/markets/stock-markets/q3-results-today-highlights-bharti-airtel-lic-hero-motocorp-kaynes-hitachi-godrej-properties-max-healthcare-ioc-tata-motors-pv-physicswallah-trent-bajaj-finserv-results-05-feb-2026/article70594308.ece",
      "pubDate": "Thu, 05 Feb 2026 14:56:47 GMT",
      "pubDateISO": "2026-02-05T14:56:47+00:00",
      "snippet": "Q3 Results Today, 05th Feb 2026 Highlights: Find all the latest Q3 results 2026 updates of Bharti Airtel, Life Insurance Corporation of India, Indian Oil Corporation, Tata Motors Passenger Vehicles, Power Finance Corporation, Hero MotoCorp, Max Healthcare Ins…",
      "content": "February 5, 2026 20:22Berger Paints Q3 results live: Net profit slips 8.3% to Rs 271.35 cr Berger Paints India on Thursday reported a decline of 8.3 per cent in its consolidated net profi… [+26672 chars]",
      "query": "Green Flag Ventures"
    },
    {
      "headline": "Stock Market Highlights: Sensex plunged 1546.84 pts or 1.88% to close at 80,722.94, and Nifty 50 dragged 495.20 pts or 1.96% to settle below 25,000 mark at 24,825.45; STT on futures contracts increased from 0.02% to 0.05% in Budget",
      "source": "BusinessLine",
      "link": "https://www.thehindubusinessline.com/markets/nse-bse-stock-market-nifty-sensex-highlights-1-february-2026/article70574928.ece",
      "pubDate": "Sun, 01 Feb 2026 11:00:21 GMT",
      "pubDateISO": "2026-02-01T11:00:21+00:00",
      "snippet": "Sensex, Nifty, Share Price Highlights: Benchmark indices were trading in sharply negative territory after the Budget proposed taxing buyback for all types of shareholders as capital gains, and the securities transaction tax on futures was raised to 0.05% from…",
      "content": "February 1, 2026 16:20Share market live today: Budget 2026: Experts flag STT hike concerns, support long-term structural reforms India Budget 2026-27: STT hike hits markets, capex and for… [+55572 chars]",
      "query": "Green Flag Ventures"
    },
    {
      "headline": "Q3 Results Highlights: Ambuja Cements Q3 profit tumbles, Nestle India & AIA Engineering profit jump, Brigade Enterprises profit decline",
      "source": "BusinessLine",
      "link": "https://www.thehindubusinessline.com/markets/stock-markets/q3-results-highlights-bajaj-auto-nptc-blue-dart-nestle-cholamandalam-investment-godfrey-phillips-itc-swiggy-tmcv-paytm-canara-adani-power-kpit-vedanta-results-30-jan-2026/article70568790.ece",
      "pubDate": "Fri, 30 Jan 2026 16:13:10 GMT",
      "pubDateISO": "2026-01-30T16:13:10+00:00",
      "snippet": "Q3 Results Today, 30th Jan 2026 Highlights: Find all the latest Q3 results 2026 updates of NTPC, Bajaj Auto, Nestlé India, Power Grid Corporation of India, Bank of Baroda, Cholamandalam Investment and Finance Company, Ambuja Cements, Jindal Steel, National Al…",
      "content": "January 30, 2026 21:41This live blog is now closed. January 30, 2026 20:36Nestle India Q3 Results Live: Nestle Indias consolidated net profit soars 45.2% Nestle Indias consoli… [+27168 chars]",
      "query": "Green Flag Ventures"
    },
    {
      "headline": "Stock Market Highlights Jan 30: Sensex ends 296 points lower at 82,269, Nifty skids 98 points to 25,320; markets snap 3-day rally, dragged lower by metal, IT stocks",
      "source": "BusinessLine",
      "link": "https://www.thehindubusinessline.com/markets/share-market-nifty-sensex-highlights-30-jan-2026/article70567248.ece",
      "pubDate": "Fri, 30 Jan 2026 11:22:34 GMT",
      "pubDateISO": "2026-01-30T11:22:34+00:00",
      "snippet": "Sensex, Nifty, Share Prices Updates: Markets closed the session on a weak note, ahead of the Budget presentation on Sunday. Metal and IT stocks dragged the markets lower, with Tata Steel the top loser, closing over 4 per cent lower. Foreign fund outflows and …",
      "content": "January 30, 2026 16:44Rupee touches all-time low of 92.02/$, pares losses to end at 91.97 The rupee on Friday hit its record low of 92.02 before ending a tad higher at 91.97 against the U… [+95707 chars]",
      "query": "Green Flag Ventures"
    }
  ]
}